# 第五章 Pandas入门

## 数据结构

### 创建Series Dataframe 对象

传入嵌套字典

In [25]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [26]:
pop={'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2002:3.6}}
f1=DataFrame(pop)
f1

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   NaN
2002     2.9   3.6

### index的方法和属性<br>
方法|说明
:--|:--
`append` |连接两个 `index` ，产生一个**新的 Index**                                                   
`delete` |删除索引 `i` 处的元素，并得到**新的 Index**
`is_monotonic` |是否单调递增
`is_unique` |`index` 中没有重复项时，返回 `True`
`unique` |计算 index 中唯一值的数组

## 基本功能

### reindex

#### Series

In [27]:
obj=Series(['blue','yellow','red'],index=[0,2,4])
obj2=obj.reindex(range(6),method='ffill')

#### DataFrame
传入一个列表，重新索引行<br>
传入两个 list ,分别重新索引行列<br>
重新索引列：`frame.reindex(columns=list)`

In [28]:
frame=DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['Ohio','Texas','California'])

**对行进行索引**

In [29]:
frame2=frame.reindex(['a','d','b','c'],method="ffill")  
frame2

   Ohio  Texas  California
a     0      1           2
d     6      7           8
b     3      4           5
c     6      7           8

※ **用 method 的前提：**`index must be monotonic increasing or decreasing`
<br>`method='ffill'`
<br>所以d行的值，取自c行：`frame['d']=frame['c']`

In [30]:
frame2.columns=[1,2,3]
frame3=frame2.reindex(columns=[1,2,3,4,5,5],method='ffill')     #bfill 时返回 NaN
frame3.columns=['col1','col2','col3','col4','col5','col6']
frame3

   col1  col2  col3  col4  col5  col6
a     0     1     2     2     2     2
d     6     7     8     8     8     8
b     3     4     5     5     5     5
c     6     7     8     8     8     8

In [31]:
frame3.xs('col2',axis=1)  #xs方法，获得单行或单列

a    1
d    7
b    4
c    7
Name: col2, dtype: int32

**NOTES**
1. `columns` 为有序值时，可用 `method` 确认`fill` 方式。
2. 当传入两个列表同时 `reindex` 行列，`method` 只应用于 **行**
3. 调用 `limit` 时，`columns/index` 必须是单调的

### 丢弃值 `get/set values`

In [32]:
#丢弃行
frame3.drop('a')
#丢弃列
new_frame=frame3.drop('col6',axis=1)   #drop返回新的DataFrame对象

In [33]:
frame3.set_value('c','col5',-1)
frame3

   col1  col2  col3  col4  col5  col6
a     0     1     2     2     2     2
d     6     7     8     8     8     8
b     3     4     5     5     5     5
c     6     7     8     8    -1     8

### 填充
1. `reindex` `method` 填充： [`ffill`](#reindex)、`bfill`
2. 值填充，`fill_value`
3. `reindex` 时也可传入 `fill_value`

In [34]:
df1=DataFrame(np.arange(12).reshape(3,4),columns=list('abcd'))
df2=DataFrame(np.arange(20).reshape(4,5),columns=list('abcde'))
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [35]:
df1.add(df2,fill_value=0)    #fill_value的值传入df1/df1的NaN位置，两个同时为NaN的位置，仍为NaN

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

**算术方法**


方法|说明
:--|:--
add|加
sub|减
mul|乘
div|除

### DataFrame与Series之间的运算
行广播运算(默认)
```python
df-series    #按行广播
```
列广播
```python
df.sub(series,axis=0)  #传入的轴是希望seriesd.index匹配的轴，匹配0轴后，在1轴上广播
```

### 函数应用与映射

In [36]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.052854 -0.329153 -1.833189
Ohio   -1.224643 -0.791110 -0.193760
Texas  -0.741936 -2.260033 -1.252239
Oregon  0.057384  0.681744 -1.832685

**`apply`**方法<br>
作用在一行或一列上，默认0轴

In [37]:
f=lambda x: x.max()-x.min()
frame.apply(f)
frame.apply(f,axis=1)

Utah      1.886043
Ohio      1.030882
Texas     1.518097
Oregon    2.514429
dtype: float64

In [38]:
def f2(x):
    return Series([x.min(),x.max()],index=['min','max'])
frame.apply(f2)

            b         d         e
min -1.224643 -2.260033 -1.833189
max  0.057384  0.681744 -0.193760

In [39]:
f3=lambda x: Series([x.min(),x.max()],index=['min','max'])
frame.apply(f3)

            b         d         e
min -1.224643 -2.260033 -1.833189
max  0.057384  0.681744 -0.193760

**`applymap`**
<br>作用Series的单个元素上<br>
like doing `map(func, series)` for each series in the DataFrame
<br>e.g.内容格式化

In [40]:
format=lambda x: '%.2f' %x
frame.applymap(format)

            b      d      e
Utah     0.05  -0.33  -1.83
Ohio    -1.22  -0.79  -0.19
Texas   -0.74  -2.26  -1.25
Oregon   0.06   0.68  -1.83

### 排序 `sort`
Refer: [numpy排序](ch04_01.ipynb#排序)
1. 按索引排序: 
```python
Series.sort_index()
Df.sort_index()
Df.sort_index(axis=1)
```
2. 按值排序
```python
Series.order()
Df.sort_index(by='column_name')   #will be deprecated
Df.sort_values(by=['a','b'])    #先按a排序，a值相同再按b排序
```

### 排名 `ranking`

返回元素在数组中的排名。<br>
相同值的处理：

method|说明
:--|:---
average|默认：Equal values are assigned a rank that is the average of the ranks of those values
min|使用最小排名
max|使用最大排名
first|按出现顺序排名

In [41]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame.rank(axis=1,method='first')

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

## 汇总和计算描述统计

`pandas.io.data` 模块已迁移到 `pandas_datareader` ( [`Doc`](http://pandas-datareader.readthedocs.io/en/latest/) )
```python
conda install pandas-datareader
```

In [42]:
from pandas_datareader import data
import datetime

### Series.pct_change()
<br>返回的Series：在 `index=2` 处：$$\frac{value[2]-value[1]}{value[1]}$$

In [55]:
ss=Series([1,2,3])
ss.pct_change()

0    NaN
1    1.0
2    0.5
dtype: float64

### 协方差/相关系数
`.corr` `cov` `corrwith`

In [81]:
df=DataFrame(np.random.randn(5,5),columns=['a','b','c','d','e'])
df

          a         b         c         d         e
0  0.859829  0.449198  0.720861 -0.235128  0.038300
1  0.915180  0.466210 -2.288543  1.376921  1.698199
2  1.339021  0.608557  0.799556  0.728226  0.474427
3  0.290251  0.831206 -0.357724  0.236785 -0.237183
4  0.439727 -0.288582  2.050697 -1.437529  0.829077

In [79]:
C=df.corr()
C

          0         1         2         3         4
0  1.000000 -0.121706  0.045201  0.493115 -0.062947
1 -0.121706  1.000000  0.111415 -0.903672  0.321358
2  0.045201  0.111415  1.000000 -0.139094  0.612112
3  0.493115 -0.903672 -0.139094  1.000000 -0.205160
4 -0.062947  0.321358  0.612112 -0.205160  1.000000

`df.corr()` 返回相关系数矩阵 $C$<br>

$C_{ij}=$ `df[i].corr(df[j])` <br>

$C_{ij}=C_{ji}$

In [78]:
df[2].corr(df[1])

0.11141495284831324

In [83]:
df.corrwith(df['c'])

a   -0.117296
b   -0.558252
c    1.000000
d   -0.853813
e   -0.450722
dtype: float64

### 常用方法
1. 唯一性
2. 计数
3. 成员资格

In [84]:
obj=Series(['a','c','d','a','a','b','c','c'])

In [89]:
obj.unique()                                       #唯一性
obj.value_counts()                                 #计数
pd.value_counts(obj.values,sort=False)

b    1
a    3
d    1
c    3
dtype: int64

**成员资格**

In [94]:
mask=obj.isin(['a','d'])
obj[mask]

0    a
2    d
3    a
4    a
dtype: object

 **DataFrame.apply**(func, axis=0, broadcast=False, raw=False, reduce=None, args=(), **kwds)[source]

    Applies function along input axis of DataFrame.

    Objects passed to functions are Series objects having index either the DataFrame’s index (axis=0) or the columns (axis=1).

In [99]:
data=DataFrame({'qu1':[1,3,4,3,4],
               'qu2':[2,3,1,2,3],
               'que3':[1,5,2,4,4]})
data.apply(pd.value_counts).fillna(0)

   qu1  qu2  que3
1  1.0  1.0   1.0
2  0.0  2.0   1.0
3  2.0  2.0   0.0
4  2.0  0.0   2.0
5  0.0  0.0   1.0

## 处理缺失数据
### 填充确实数据

In [151]:
df=DataFrame(np.random.randn(7,3))
df.iloc[:3,1:]=np.nan    
df.iloc[[3,4],1]=np.nan
df

          0         1         2
0  0.080190       NaN       NaN
1  1.145875       NaN       NaN
2  1.905243       NaN       NaN
3 -1.541922       NaN  1.056550
4 -0.246651       NaN  0.680294
5  0.429619  2.450109  1.092299
6 -0.032563 -0.552866  0.464467

#### 保留有效值个数2及2以上的行

In [154]:
df.dropna(thresh=2)

          0         1         2
3 -1.541922       NaN  1.056550
4 -0.246651       NaN  0.680294
5  0.429619  2.450109  1.092299
6 -0.032563 -0.552866  0.464467

#### 不同的列填充不同的值
传入一个 `dict`

In [153]:
df.fillna({1:1,2:2})

          0         1         2
0  0.080190  1.000000  2.000000
1  1.145875  1.000000  2.000000
2  1.905243  1.000000  2.000000
3 -1.541922  1.000000  1.056550
4 -0.246651  1.000000  0.680294
5  0.429619  2.450109  1.092299
6 -0.032563 -0.552866  0.464467

#### 就地修改原对象
`.fillna` 默认返回一个 `copy` 

就地修改：`.fillna(value,inpalce=True)`

## 5.5 层次化索引

In [183]:
data=Series(np.random.randn(10),index=[['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,2,3]])
data,data.index

(a  1   -0.598748
    2    0.305426
    3    0.006906
 b  1   -0.275999
    2   -1.254720
    3    0.716770
 c  1   -1.936209
    2   -0.828715
 d  2    1.256150
    3    0.812937
 dtype: float64, MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
            labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]]))

In [191]:
frame=DataFrame(np.random.rand(4,3),index=[['a','a','b','b'],[1,2,1,2]],columns=[['ohio','ohio','cali'],['green','red','green']])
frame

         ohio                cali
        green       red     green
a 1  0.337199  0.138914  0.345074
  2  0.726706  0.597475  0.352012
b 1  0.961791  0.548348  0.394297
  2  0.891936  0.522261  0.869546

In [ ]:
# m_index=pd.Multiindex

In [198]:
frame.index.names=['key1','key2']
frame.columns.names=['state','color']

frame

state          ohio                cali
color         green       red     green
key1 key2
a    1     0.337199  0.138914  0.345074
     2     0.726706  0.597475  0.352012
b    1     0.961791  0.548348  0.394297
     2     0.891936  0.522261  0.869546

In [199]:
frame.swaplevel('key1','key2')

state          ohio                cali
color         green       red     green
key2 key1
1    a     0.337199  0.138914  0.345074
2    a     0.726706  0.597475  0.352012
1    b     0.961791  0.548348  0.394297
2    b     0.891936  0.522261  0.869546

In [200]:
frame

state          ohio                cali
color         green       red     green
key1 key2
a    1     0.337199  0.138914  0.345074
     2     0.726706  0.597475  0.352012
b    1     0.961791  0.548348  0.394297
     2     0.891936  0.522261  0.869546

### 5.5.1 重排分级顺序

### 5.5.2 据级别汇总统计

### 5.5.3 使用DataFrame的列做索引

## 5.6 其他有关Pandas的话题

### 5.6.1 整数索引

`Series`<br>
当索引中 *有整数* 时，根据整数进行数据切片的操作都是面向**标签**的。

当索引中无整数时，根据整数进行数据切片的操作都是都是面向**顺序**的

`DataFrame`<br>
`df` 用 `loc` 进行标签索引，`iloc` 进行顺序索引

In [164]:
dff=DataFrame(np.random.rand(5,4),columns=[1,-1,4,5])
dff

          1        -1         4         5
0  0.651477  0.471065  0.077180  0.694914
1  0.567100  0.421646  0.213119  0.714282
2  0.243572  0.426925  0.787045  0.341507
3  0.597694  0.549733  0.196543  0.953972
4  0.817525  0.733044  0.533747  0.059726

In [165]:
dff[-1]

0    0.471065
1    0.421646
2    0.426925
3    0.549733
4    0.733044
Name: -1, dtype: float64

In [167]:
dff2=DataFrame(np.random.randn(5,4),columns=['a','f','b','d'])
dff2

          a         f         b         d
0  1.714238 -0.590831  1.171658 -0.743695
1  0.862268 -0.574016 -0.733401 -0.218081
2  1.512762  0.926844 -0.959429 -0.779311
3  0.839851 -0.234326 -0.999369  1.035211
4  0.749335  0.048108  0.365335  1.381262

In [173]:
dff2.iloc[:,-1]

0   -0.743695
1   -0.218081
2   -0.779311
3    1.035211
4    1.381262
Name: d, dtype: float64

### 5.6.2 面板数据